yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l050j3.h
#define DMA1_C3SPR_TCIF          DMA1_C3SPR_bit.TCIF
#define DMA1_C3SPR_HTIF          DMA1_C3SPR_bit.HTIF
#define DMA1_C3SPR_TSIZE         DMA1_C3SPR_bit.TSIZE
#define DMA1_C3SPR_PL0           DMA1_C3SPR_bit.PL0
#define DMA1_C3SPR_PL1           DMA1_C3SPR_bit.PL1
#define DMA1_C3SPR_PEND          DMA1_C3SPR_bit.PEND
#define DMA1_C3SPR_BUSY          DMA1_C3SPR_bit.BUSY

#define DMA1_C3NDTR_NDT0         DMA1_C3NDTR_bit.NDT0
#define DMA1_C3NDTR_NDT1         DMA1_C3NDTR_bit.NDT1
#define DMA1_C3NDTR_NDT2         DMA1_C3NDTR_bit.NDT2
#define DMA1_C3NDTR_NDT3         DMA1_C3NDTR_bit.NDT3
#define DMA1_C3NDTR_NDT4         DMA1_C3NDTR_bit.NDT4
#define DMA1_C3NDTR_NDT5         DMA1_C3NDTR_bit.NDT5
#define DMA1_C3NDTR_NDT6         DMA1_C3NDTR_bit.NDT6
#define DMA1_C3NDTR_NDT7         DMA1_C3NDTR_bit.NDT7

#define DMA1_C3PARH_C3M1ARH_MEM_CLR_PA8 DMA1_C3PARH_C3M1ARH_bit.mem_clr.PA8
#define DMA1_C3PARH_C3M1ARH_MEM_CLR_PA9 DMA1_C3PARH_C3M1ARH_bit.mem_clr.PA9
#define DMA1_C3PARH_C3M1ARH_MEM_CLR_PA10 DMA1_C3PARH_C3M1ARH_bit.mem_clr.PA10
#define DMA1_C3PARH_C3M1ARH_MEM_CLR_PA11 DMA1_C3PARH_C3M1ARH_bit.mem_clr.PA11
#define DMA1_C3PARH_C3M1ARH_MEM_CLR_PA12 DMA1_C3PARH_C3M1ARH_bit.mem_clr.PA12
#define DMA1_C3PARH_C3M1ARH_MEM_CLR_PA13 DMA1_C3PARH_C3M1ARH_bit.mem_clr.PA13
#define DMA1_C3PARH_C3M1ARH_MEM_CLR_PA14 DMA1_C3PARH_C3M1ARH_bit.mem_clr.PA14
#define DMA1_C3PARH_C3M1ARH_MEM_CLR_PA15 DMA1_C3PARH_C3M1ARH_bit.mem_clr.PA15
#define DMA1_C3PARH_C3M1ARH_MEM_SET_M1A8 DMA1_C3PARH_C3M1ARH_bit.mem_set.M1A8
#define DMA1_C3PARH_C3M1ARH_MEM_SET_M1A9 DMA1_C3PARH_C3M1ARH_bit.mem_set.M1A9
#define DMA1_C3PARH_C3M1ARH_MEM_SET_M1A10 DMA1_C3PARH_C3M1ARH_bit.mem_set.M1A10
#define DMA1_C3PARH_C3M1ARH_MEM_SET_M1A11 DMA1_C3PARH_C3M1ARH_bit.mem_set.M1A11
#define DMA1_C3PARH_C3M1ARH_MEM_SET_M1A12 DMA1_C3PARH_C3M1ARH_bit.mem_set.M1A12
#define DMA1_C3PARH_C3M1ARH_MEM_SET_M1A13 DMA1_C3PARH_C3M1ARH_bit.mem_set.M1A13
#define DMA1_C3PARH_C3M1ARH_MEM_SET_M1A14 DMA1_C3PARH_C3M1ARH_bit.mem_set.M1A14
#define DMA1_C3PARH_C3M1ARH_MEM_SET_M1A15 DMA1_C3PARH_C3M1ARH_bit.mem_set.M1A15

/* Bit field aliases for DMA1_C3PARH_C3M1ARH.mem_clr */
#define DMA1_C3PARH_PA8          DMA1_C3PARH_bit.PA8
#define DMA1_C3PARH_PA9          DMA1_C3PARH_bit.PA9
#define DMA1_C3PARH_PA10         DMA1_C3PARH_bit.PA10
#define DMA1_C3PARH_PA11         DMA1_C3PARH_bit.PA11
#define DMA1_C3PARH_PA12         DMA1_C3PARH_bit.PA12
#define DMA1_C3PARH_PA13         DMA1_C3PARH_bit.PA13
#define DMA1_C3PARH_PA14         DMA1_C3PARH_bit.PA14
#define DMA1_C3PARH_PA15         DMA1_C3PARH_bit.PA15


/* Bit field aliases for DMA1_C3PARH_C3M1ARH.mem_set */
#define DMA1_C3M1ARH_M1A8        DMA1_C3M1ARH_bit.M1A8
#define DMA1_C3M1ARH_M1A9        DMA1_C3M1ARH_bit.M1A9
#define DMA1_C3M1ARH_M1A10       DMA1_C3M1ARH_bit.M1A10
#define DMA1_C3M1ARH_M1A11       DMA1_C3M1ARH_bit.M1A11
#define DMA1_C3M1ARH_M1A12       DMA1_C3M1ARH_bit.M1A12
#define DMA1_C3M1ARH_M1A13       DMA1_C3M1ARH_bit.M1A13
#define DMA1_C3M1ARH_M1A14       DMA1_C3M1ARH_bit.M1A14
#define DMA1_C3M1ARH_M1A15       DMA1_C3M1ARH_bit.M1A15


#define DMA1_C3PARL_C3M1ARL_MEM_CLR_PA0 DMA1_C3PARL_C3M1ARL_bit.mem_clr.PA0
#define DMA1_C3PARL_C3M1ARL_MEM_CLR_PA1 DMA1_C3PARL_C3M1ARL_bit.mem_clr.PA1
#define DMA1_C3PARL_C3M1ARL_MEM_CLR_PA2 DMA1_C3PARL_C3M1ARL_bit.mem_clr.PA2
#define DMA1_C3PARL_C3M1ARL_MEM_CLR_PA3 DMA1_C3PARL_C3M1ARL_bit.mem_clr.PA3
#define DMA1_C3PARL_C3M1ARL_MEM_CLR_PA4 DMA1_C3PARL_C3M1ARL_bit.mem_clr.PA4
#define DMA1_C3PARL_C3M1ARL_MEM_CLR_PA5 DMA1_C3PARL_C3M1ARL_bit.mem_clr.PA5
#define DMA1_C3PARL_C3M1ARL_MEM_CLR_PA6 DMA1_C3PARL_C3M1ARL_bit.mem_clr.PA6
#define DMA1_C3PARL_C3M1ARL_MEM_CLR_PA7 DMA1_C3PARL_C3M1ARL_bit.mem_clr.PA7
#define DMA1_C3PARL_C3M1ARL_MEM_SET_M1A0 DMA1_C3PARL_C3M1ARL_bit.mem_set.M1A0
#define DMA1_C3PARL_C3M1ARL_MEM_SET_M1A1 DMA1_C3PARL_C3M1ARL_bit.mem_set.M1A1
#define DMA1_C3PARL_C3M1ARL_MEM_SET_M1A2 DMA1_C3PARL_C3M1ARL_bit.mem_set.M1A2
#define DMA1_C3PARL_C3M1ARL_MEM_SET_M1A3 DMA1_C3PARL_C3M1ARL_bit.mem_set.M1A3
#define DMA1_C3PARL_C3M1ARL_MEM_SET_M1A4 DMA1_C3PARL_C3M1ARL_bit.mem_set.M1A4
#define DMA1_C3PARL_C3M1ARL_MEM_SET_M1A5 DMA1_C3PARL_C3M1ARL_bit.mem_set.M1A5
#define DMA1_C3PARL_C3M1ARL_MEM_SET_M1A6 DMA1_C3PARL_C3M1ARL_bit.mem_set.M1A6
#define DMA1_C3PARL_C3M1ARL_MEM_SET_M1A7 DMA1_C3PARL_C3M1ARL_bit.mem_set.M1A7

/* Bit field aliases for DMA1_C3PARL_C3M1ARL.mem_clr */
#define DMA1_C3PARL_PA0          DMA1_C3PARL_bit.PA0
#define DMA1_C3PARL_PA1          DMA1_C3PARL_bit.PA1
#define DMA1_C3PARL_PA2          DMA1_C3PARL_bit.PA2
#define DMA1_C3PARL_PA3          DMA1_C3PARL_bit.PA3
#define DMA1_C3PARL_PA4          DMA1_C3PARL_bit.PA4
#define DMA1_C3PARL_PA5          DMA1_C3PARL_bit.PA5
#define DMA1_C3PARL_PA6          DMA1_C3PARL_bit.PA6
#define DMA1_C3PARL_PA7          DMA1_C3PARL_bit.PA7


/* Bit field aliases for DMA1_C3PARL_C3M1ARL.mem_set */
#define DMA1_C3M1ARL_M1A0        DMA1_C3M1ARL_bit.M1A0
#define DMA1_C3M1ARL_M1A1        DMA1_C3M1ARL_bit.M1A1
#define DMA1_C3M1ARL_M1A2        DMA1_C3M1ARL_bit.M1A2
#define DMA1_C3M1ARL_M1A3        DMA1_C3M1ARL_bit.M1A3
#define DMA1_C3M1ARL_M1A4        DMA1_C3M1ARL_bit.M1A4
#define DMA1_C3M1ARL_M1A5        DMA1_C3M1ARL_bit.M1A5
#define DMA1_C3M1ARL_M1A6        DMA1_C3M1ARL_bit.M1A6
#define DMA1_C3M1ARL_M1A7        DMA1_C3M1ARL_bit.M1A7


#define DMA1_C3M0EAR_M0A16       DMA1_C3M0EAR_bit.M0A16

#define DMA1_C3M0ARH_M0A8        DMA1_C3M0ARH_bit.M0A8
#define DMA1_C3M0ARH_M0A9        DMA1_C3M0ARH_bit.M0A9
#define DMA1_C3M0ARH_M0A10       DMA1_C3M0ARH_bit.M0A10
#define DMA1_C3M0ARH_M0A11       DMA1_C3M0ARH_bit.M0A11
#define DMA1_C3M0ARH_M0A12       DMA1_C3M0ARH_bit.M0A12
#define DMA1_C3M0ARH_M0A13       DMA1_C3M0ARH_bit.M0A13
#define DMA1_C3M0ARH_M0A14       DMA1_C3M0ARH_bit.M0A14
#define DMA1_C3M0ARH_M0A15       DMA1_C3M0ARH_bit.M0A15

#define DMA1_C3M0ARL_M0A0        DMA1_C3M0ARL_bit.M0A0
#define DMA1_C3M0ARL_M0A1        DMA1_C3M0ARL_bit.M0A1
#define DMA1_C3M0ARL_M0A2        DMA1_C3M0ARL_bit.M0A2
#define DMA1_C3M0ARL_M0A3        DMA1_C3M0ARL_bit.M0A3
#define DMA1_C3M0ARL_M0A4        DMA1_C3M0ARL_bit.M0A4
#define DMA1_C3M0ARL_M0A5        DMA1_C3M0ARL_bit.M0A5
#define DMA1_C3M0ARL_M0A6        DMA1_C3M0ARL_bit.M0A6
#define DMA1_C3M0ARL_M0A7        DMA1_C3M0ARL_bit.M0A7

#endif

/*-------------------------------------------------------------------------
 *      DMA1 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_DMA1_GCSR_GEN       0x01
#define MASK_DMA1_GCSR_GB        0x02
#define MASK_DMA1_GCSR_TO        0xFC

#define MASK_DMA1_GIR1_IFC0      0x01
#define MASK_DMA1_GIR1_IFC1      0x02
#define MASK_DMA1_GIR1_IFC2      0x04
#define MASK_DMA1_GIR1_IFC3      0x08

